---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.Insert(Autodesk.Revit.DB.Group)
source: html/073aaf81-3df4-f4f6-c999-905b5c2cd7f7.htm
---
# Autodesk.Revit.DB.GroupSet.Insert Method

Insert the specified group into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	Group item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Group`) - The group to be inserted into the set.

## Returns
Returns whether the group was inserted into the set.